УНФ_ТЕСТ/src/InformationRegisters/КП_МатрицаЗаместителей/КП_МатрицаЗаместителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_МатрицаЗаместителей</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЗаместительСотрудника</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НачинатьЗаменуЕслиНетОтветаЧерезПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заместитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗамены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗамещаемыйСотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаменаНеАктуальна</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТолькоДляВидаПроцесса</name>
    <type>
      <types>CatalogRef.КП_ВидыПроцессов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/КП_МатрицаЗаместителей/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбластьДействияЧисло=?(ЗначениеЗаполнено(Запись.ТолькоДляВидаПроцесса), 1, 0);
	
	УстановитьОтображениеЭлементов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаНеАктуальнаПриИзменении(Элемент)
	Если Запись.ЗаменаНеАктуальна И НЕ ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
		Запись.ДатаОкончания=ТекущаяДата();
		
	КонецЕсли;
	
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

Процедура УстановитьОтображениеЭлементов()
	Элементы.Период.Доступность=НЕ Запись.ЗаменаНеАктуальна;
	Элементы.ДатаОкончания.Доступность=НЕ Запись.ЗаменаНеАктуальна;
	УстановитьОформлениеОбластиДействия();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьДействияЧислоПриИзменении(Элемент)
	
	Модифицированность=Истина;
	
	УстановитьОформлениеОбластиДействия();
	
	Если ОбластьДействияЧисло=0 Тогда
		Запись.ТолькоДляВидаПроцесса=Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОформлениеОбластиДействия()
	Элементы.ТолькоДляВидаПроцесса.Видимость=(ОбластьДействияЧисло=1);
	
КонецПроцедуры
